using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace LinqMethods
{
    
    public partial class Form1 : Form
    {
        List<News> news = null;
        int i = 0;
        int j = 0;
        public Form1()
        {
            InitializeComponent();
            NewsText1.Enabled = false;
            NewsTitle1.Enabled = false;
            NewsText2.Enabled = false;
            NewsTitle2.Enabled = false;
            news = new List<News>
            {
                new News{Title = "Гражданская война: главарь 'ДНР' прозрел и сдался Украине", Text = "Как установили правоохранители, мужчина присоединился к террористам еще в сентябре 2014 года. Изначально он вошел в состав так называемого 'Индустриального оплота Донбасса', где занимался поставкой в ОРДО удобрений, горюче-смазочных материалов и других товаров, закупкой зерна и конечной продукции сельского хозяйства.'Впоследствии, возглавив по предложению Захарченко' министерство агропромышленной политики и продовольствия' террористов, злоумышленник под кураторством российских спецслужб обеспечивал формирование штата и функционирование фейкового ведомства. Среди прочего, он также 'санкционировал' прибытие на оккупированные территории Донбасса грузов так называемого 'российского гуманитарного конвоя', - написано в сообщении.", Images = "0.jpg" },
                new News{Title = "Джим Керри снялся в необычной постельной сцене", Text = "Голливудский актер Джим Керри, который недавно дал откровенное интервью, снялся в сериале 'Шучу' в необычной сексуальной сцене. По сюжету, партнершей его героя является онкобольная девушка, пишет The Daily Mail. В телевизионном шоу Керри предстает в образе звезды детских передач. А сам герой за пределами экранов переживает далеко не лучший период в жизни. В одной из сцен он занимается сексом с онкобольной девушкой, с которой знакомится во время посещения одной из больниц. Отмечается, что сама роль довольно драматична.", Images = "1.jpg" },
                new News{Title = "СК Днепр 1 - Волынь. Анонс 1/16 финала кубока Украины", Text = @"Завтра, у середу, 26 вересня, на полі стадіону «Дніпро-Арена» відбудеться матч третього раунду (1\16 фіналу) Кубка України, в якому спортклубівці прийматимуть луцьку «Волинь». Початок зустрічі о 18 годині. Рівно місяць тому, 26 серпня, дві команди, що зараз ведуть відчайдушну боротьбу за лідерство у Першій лізі вже зустрічались між собою на тому ж самому місці. І тоді лучани, що до візиту на «Дніпро-Арену» не мали а ні втрачених очок, а ні пропущених м’ячів, отримали від спортклубівців у власні ворота п’ять без відповідних м’ячів (відзначились Олексій Чичиков,32, Ігор Когут,37, Дмитро Башлай, 59, Олександр Назаренко,70, Володимир Польовий,88). На цей час команди посідають в чемпіонаті перше та третє місця, при цьому перевага дніпрян рахується лише двома очками. Проте у Кубка власні закони. Тут усе треба розпочинати спочатку, тому можна не сумніватися, що лучани, які стовідсотково зробили висновки з тієї гучної поразки, намагатимуться не припускатися подібних помилок, ну а дніпряни, які ще у минулому сезоні отримали кубковий переможний смак, будуть доводити, що той розгром був не випадковий. На кубковому шляху обидві команди в стартовому для себе раунді подолали у гостях представників Другої ліги. Спортклубівці на минулому тижні довели свою перевагу у дербі із запорізьким МФК «Металург» – 2:0 (Сергій Кравченко,54,Станіслав Куліш,77), ну а волиняни у дуже непростому двобої, тільки у додатковий час, за ходом якого довелося відіграватися, з рахунком 3:2 зуміли дотиснути «Таврію-Сімферополь» (Куксенко,25, Біжко,101 – Климець,13, Карпенко,109, Курко,118). Судитиме завтрашній матч бригада арбітрів на чолі з Юрієм Івановим з Донеччини. Одного разу в цьому сезоні він вже обслуговував матч за участю спортклубівців, зафіксувавши перемогу дніпрян у Винниках над тамтешнім «Рухом» – 3:1. В цій грі він показав дві жовті картки спортклубівцям і три їх суперникам.", Images= "2.jpg"},
                new News{Title = "Люди бегут, орудуют мародеры: Армянск превратился в город-призрак после кислотной атаки", Text = "'На выходных в Армянске снова воняло хлоркой. Я рано утром встала, был туман и дышать было нечем. А дети уже приехали, снова всем этим дышат. 'Власти' уверяют, что все прекрасно. Однако на улицах даже не убирают опавшие листья. Они ведь всю эту кислоту впитали, жечь их нельзя. Никто не знает, что с ними делать', - сообщила нам жительница Армянска, мама двух детей Виктория.", Images = "3.jpg"}
            };
            
        }

        private void button2_Click(object sender, EventArgs e)
        {
            
                if (i < news.Count)
                {

                    NewsTitle1.Text = news[i].Title;
                    NewsText1.Text = news[i].Text;
                    NewsImage1.SizeMode = PictureBoxSizeMode.Zoom;
                    NewsImage1.Image = Image.FromFile(news[i].Images);
                    i++;
                }

                if (i < news.Count && i % 2 != 0)
                {
                    NewsTitle2.Text = news[i].Title;
                    NewsText2.Text = news[i].Text;
                    NewsImage2.SizeMode = PictureBoxSizeMode.Zoom;
                    NewsImage2.Image = Image.FromFile(news[i].Images);
                    i++;
                }

            else if (i == news.Count)
            {
                i = 0;
                NewsTitle2.Text = news[i].Title;
                NewsText2.Text = news[i].Text;
                NewsImage2.SizeMode = PictureBoxSizeMode.Zoom;
                NewsImage2.Image = Image.FromFile(news[i].Images);
            }
        }

        private void button1_Click(object sender, EventArgs e)
        {
            if (i < news.Count && i!=0)
            {
                NewsTitle1.Text = news[i].Title;
                NewsText1.Text = news[i].Text;
                NewsImage1.SizeMode = PictureBoxSizeMode.Zoom;
                NewsImage1.Image = Image.FromFile(news[i].Images);
                i--;
            }

            if (i < news.Count && i % 2 != 0)
            {
                NewsTitle2.Text = news[i].Title;
                NewsText2.Text = news[i].Text;
                NewsImage2.SizeMode = PictureBoxSizeMode.Zoom;
                NewsImage2.Image = Image.FromFile(news[i].Images);
                i--;
            }

            else if (i == 0)
            {
                i = 3;
                NewsTitle2.Text = news[i].Title;
                NewsText2.Text = news[i].Text;
                NewsImage2.SizeMode = PictureBoxSizeMode.Zoom;
                NewsImage2.Image = Image.FromFile(news[i].Images);
            }

        }
    }

    class News
    {
        public string Title { get; set; }
        public string Text { get; set; }
        public string Images { get; set; }

    }
}
